# long data 만들기 

-각 변수는 하나의 컬럼에 배치
- 각 관측치는 한행에 1건씩 분리되어 배치 
- 각 값은 개별 셀에 배치

-melt()
-piovt()
-pivot_table(): 집계함수 적용

In [2]:
import pandas as pd

In [5]:
df=pd.read_csv(r'./data/pew.csv')
type(df)

pandas.core.frame.DataFrame

In [6]:
df.head(2)

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76

In [7]:
pd.melt(df)

               variable               value
0              religion            Agnostic
1              religion             Atheist
2              religion            Buddhist
3              religion            Catholic
4              religion  Don’t know/refused
..                  ...                 ...
193  Don't know/refused                  73
194  Don't know/refused                  18
195  Don't know/refused                  71
196  Don't know/refused                   8
197  Don't know/refused                 597

[198 rows x 2 columns]

In [12]:
df.melt(id_vars='religion').sort_values('religion').head(18)

     religion            variable  value
0    Agnostic               <$10k     27
144  Agnostic               >150k     84
162  Agnostic  Don't know/refused     96
126  Agnostic           $100-150k    109
36   Agnostic             $20-30k     60
108  Agnostic            $75-100k    122
18   Agnostic             $10-20k     34
90   Agnostic             $50-75k    137
72   Agnostic             $40-50k     76
54   Agnostic             $30-40k     81
109   Atheist            $75-100k     73
19    Atheist             $10-20k     27
55    Atheist             $30-40k     52
91    Atheist             $50-75k     70
127   Atheist           $100-150k     59
145   Atheist               >150k     74
73    Atheist             $40-50k     35
37    Atheist             $20-30k     37

In [13]:
df_melt=df.melt(id_vars='religion')
df_melt

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [16]:
cond=df_melt['religion']=='Agnostic'

In [17]:
df_melt.loc[cond]

     religion            variable  value
0    Agnostic               <$10k     27
18   Agnostic             $10-20k     34
36   Agnostic             $20-30k     60
54   Agnostic             $30-40k     81
72   Agnostic             $40-50k     76
90   Agnostic             $50-75k    137
108  Agnostic            $75-100k    122
126  Agnostic           $100-150k    109
144  Agnostic               >150k     84
162  Agnostic  Don't know/refused     96

In [ ]:
df_melt_rename=df_melt.rename(columns={'variable':'income','value':'conunt'})

In [21]:
df_melt_rename

                  religion              income  conunt
0                 Agnostic               <$10k      27
1                  Atheist               <$10k      12
2                 Buddhist               <$10k      27
3                 Catholic               <$10k     418
4       Don’t know/refused               <$10k      15
..                     ...                 ...     ...
175               Orthodox  Don't know/refused      73
176        Other Christian  Don't know/refused      18
177           Other Faiths  Don't know/refused      71
178  Other World Religions  Don't know/refused       8
179           Unaffiliated  Don't know/refused     597

[180 rows x 3 columns]

In [25]:
df1=pd.read_csv(r'./data/billboard.csv')
df1

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,87,82.0,72.0,77.0,87.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,91,87.0,92.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,81,70.0,68.0,67.0,66.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,3 Doors Down,Loser,4:24,2000-10-21,76,76.0,72.0,69.0,67.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,57,34.0,25.0,17.0,17.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
312,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,86,83.0,77.0,74.0,83.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
313,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,85,83.0,83.0,82.0,81.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
314,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,95,94.0,91.0,85.0,84.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
315,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,99,99.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
316,2000,matchbox twenty,Bent,4:12,2000-04-29,60,37.0,29.0,24.0,22.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [33]:
df1_melt=df1.melt(id_vars='artist')
cond1=df1_melt['artist']=='2 Pac'
df1_melt.loc[cond1]
df1_melt_rename=df1_melt.rename(columns={'variable':'Music time','value':'year'})
df1_melt_rename

                 artist Music time  year
0                 2 Pac       year  2000
1               2Ge+her       year  2000
2          3 Doors Down       year  2000
3          3 Doors Down       year  2000
4              504 Boyz       year  2000
...                 ...        ...   ...
25355       Yankee Grey       wk76   NaN
25356  Yearwood, Trisha       wk76   NaN
25357   Ying Yang Twins       wk76   NaN
25358     Zombie Nation       wk76   NaN
25359   matchbox twenty       wk76   NaN

[25360 rows x 3 columns]

# aply

In [36]:
df=pd.DataFrame({
  "a":[10,20,30],
  "b":[20,30,40]
})
df**2

     a     b
0  100   400
1  400   900
2  900  1600

In [ ]:
df/10 #vectorisation

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  4.0

In [42]:
def make_sq(x,e=2):
    return x**e

In [43]:
df.apply(make_sq,e=2.71)

              a             b
0    512.861384   3355.763054
1   3355.763054  10069.284236
2  10069.284236  21957.484078

In [45]:
import pandas as pd

# 직원 명단 DataFrame 생성
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 45, 35, 32, 28],
    'Salary': [5000, 7000, 6500, 5500, 6000]
}
sal_df=pd.DataFrame(data)
sal_df

      Name  Age  Salary
0    Alice   25    5000
1      Bob   45    7000
2  Charlie   35    6500
3    David   32    5500
4      Eva   28    6000

In [56]:
def age_category(age):
  if age<30:
     return '20대'
  elif age<40 :
    return '30대'
  else:
    return '40대'

In [57]:
sal_df['Age_category']=sal_df['Age'].apply(age_category)
sal_df

      Name  Age  Salary Age_category   Bonus
0    Alice   25    5000          20대  1000.0
1      Bob   45    7000          40대  1400.0
2  Charlie   35    6500          30대  1300.0
3    David   32    5500          30대  1100.0
4      Eva   28    6000          20대  1200.0

In [53]:
# 보우너스
sal_df['Bonus'] = sal_df['Salary'] * 0.2

In [55]:
sal_df

      Name  Age  Salary Age_category   Bonus
0    Alice   25    5000          20대  1000.0
1      Bob   45    7000          영포티  1400.0
2  Charlie   35    6500          30대  1300.0
3    David   32    5500          30대  1100.0
4      Eva   28    6000          20대  1200.0

# 데이터 병합

In [3]:
df_1=pd.read_csv('./data/concat_1.csv')
df_2=pd.read_csv('./data/concat_2.csv')
df_3=pd.read_csv('./data/concat_3.csv')

In [4]:
df_1,df_2,df_3

(    A   B   C   D
 0  a0  b0  c0  d0
 1  a1  b1  c1  d1
 2  a2  b2  c2  d2
 3  a3  b3  c3  d3,
     A   B   C   D
 0  a4  b4  c4  d4
 1  a5  b5  c5  d5
 2  a6  b6  c6  d6
 3  a7  b7  c7  d7,
      A    B    C    D
 0   a8   b8   c8   d8
 1   a9   b9   c9   d9
 2  a10  b10  c10  d10
 3  a11  b11  c11  d11)

In [5]:
total_df=pd.concat([df_1,df_2,df_3],ignore_index=True)

In [6]:
total_df.loc[3]

A    a3
B    b3
C    c3
D    d3
Name: 3, dtype: object

In [7]:
#
# total_df.iloc[3]
total_df.reset_index()#
total_df

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [12]:
add_ser = pd.Series(['a100', 'b100', 'c100', 'd100'], index=['A', 'B', 'C', 'D']).to_frame().T

In [14]:
total_df_add=pd.concat([total_df,add_ser],ignore_index=True)
total_df_add

       A     B     C     D
0     a0    b0    c0    d0
1     a1    b1    c1    d1
2     a2    b2    c2    d2
3     a3    b3    c3    d3
4     a4    b4    c4    d4
5     a5    b5    c5    d5
6     a6    b6    c6    d6
7     a7    b7    c7    d7
8     a8    b8    c8    d8
9     a9    b9    c9    d9
10   a10   b10   c10   d10
11   a11   b11   c11   d11
12  a100  b100  c100  d100

시리즈를 행으로-> concat

-dataframe(원본과 동일한 column을 같는 데이터프레임 생성)
-column = 인덱스이름 시리즈 생성
-빈데이터프레임에 행으로 시리즈를 추가
-concat(원본,빈데이터 프레임)

# merge()
- 키를 기준으로 합친다
- sql 에서 join

In [2]:
import pandas as pd

In [ ]:
# 매출데이터
sales_data = pd.DataFrame({ 'CustomerID': [101, 102, 103, 104], 'Date': ['2023-01-01', '2023-01-03', '2023-01-05', '2023-01-07'], 'Amount': [250, 300, 150, 400] })
# 고객데이터
customer_data = pd.DataFrame({ 'CustomerID': [101, 102, 103, 105], 'Name': ['Alice', 'Bob', 'Charlie', 'Eva'], 'Region': ['North', 'South', 'East', 'West'] })

In [5]:
sales_data.info()
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  4 non-null      int64
 1   Date        4 non-null      object
 2   Amount      4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  4 non-null      int64
 1   Name        4 non-null      object
 2   Region      4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [8]:
pd.merge(customer_data,sales_data,on='CustomerID')

   CustomerID     Name Region        Date  Amount
0         101    Alice  North  2023-01-01     250
1         102      Bob  South  2023-01-03     300
2         103  Charlie   East  2023-01-05     150

In [10]:
pd.merge(customer_data,sales_data,on='CustomerID',how='right')

   CustomerID     Name Region        Date  Amount
0         101    Alice  North  2023-01-01     250
1         102      Bob  South  2023-01-03     300
2         103  Charlie   East  2023-01-05     150
3         104      NaN    NaN  2023-01-07     400

how- 병합 기준 지정
- left
- right 
- inner(default)
- outer 
- on(병합키 지정)

# 그룹연산
groupby() + aggregation 집계

In [16]:
gap_df=pd.read_csv(r'./data/gapminder.tsv',sep='\t')
gap_df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [18]:
gap_df.tail(5)

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [19]:
gap_df.country.unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [26]:
gap_df['country'].unique().shape

(142,)

In [28]:
gap_df['continent'].unique().shape
gap_df['continent'].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [29]:
gap_df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007])

In [56]:
gap_df.groupby('country')[['lifeExp']].count().describe()

       lifeExp
count    142.0
mean      12.0
std        0.0
min       12.0
25%       12.0
50%       12.0
75%       12.0
max       12.0

In [37]:
gap_df.groupby('country').get_group('Afghanistan')

        country continent  year  lifeExp       pop   gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333  779.445314
1   Afghanistan      Asia  1957   30.332   9240934  820.853030
2   Afghanistan      Asia  1962   31.997  10267083  853.100710
3   Afghanistan      Asia  1967   34.020  11537966  836.197138
4   Afghanistan      Asia  1972   36.088  13079460  739.981106
5   Afghanistan      Asia  1977   38.438  14880372  786.113360
6   Afghanistan      Asia  1982   39.854  12881816  978.011439
7   Afghanistan      Asia  1987   40.822  13867957  852.395945
8   Afghanistan      Asia  1992   41.674  16317921  649.341395
9   Afghanistan      Asia  1997   41.763  22227415  635.341351
10  Afghanistan      Asia  2002   42.129  25268405  726.734055
11  Afghanistan      Asia  2007   43.828  31889923  974.580338

In [44]:
gap_df.groupby('continent')['country'].count()

continent
Africa      624
Americas    300
Asia        396
Europe      360
Oceania      24
Name: country, dtype: int64

In [45]:
gap_df.groupby('continent')['country'].count().std()

215.4325880641088

In [53]:
gap_df.groupby('continent')['country'].count().describe()

count      5.000000
mean     340.800000
std      215.432588
min       24.000000
25%      300.000000
50%      360.000000
75%      396.000000
max      624.000000
Name: country, dtype: float64

# 자동차 생산량 데이터 모양 만들기

In [75]:
veh_df=pd.read_csv('./data/vehicle_prod.csv',index_col=0)

In [76]:
veh_df.rename(columns={'Unnamed: 0':'Country'},inplace=True)
veh_df

         2007   2008   2009   2010   2011
China    7.71   7.95  11.96  15.84  16.33
EU      19.02  17.71  15.00  16.70  17.48
US      10.47   8.45   5.58   7.60   8.40
Japan   10.87  10.83   7.55   9.09   7.88
Korea    4.04   3.78   3.45   4.20   4.62
Mexico   2.01   2.05   1.50   2.25   2.54

In [82]:
(veh_df[['2007']])

         2007
China    7.71
EU      19.02
US      10.47
Japan   10.87
Korea    4.04
Mexico   2.01

In [84]:
veh_df.sum()

2007    54.12
2008    50.77
2009    45.04
2010    55.68
2011    57.25
dtype: float64

In [ ]:
# 총생산량

In [86]:
veh_df['total_production']=veh_df.sum(axis=1)
veh_df

         2007   2008   2009   2010   2011  total_production
China    7.71   7.95  11.96  15.84  16.33            119.58
EU      19.02  17.71  15.00  16.70  17.48            171.82
US      10.47   8.45   5.58   7.60   8.40             81.00
Japan   10.87  10.83   7.55   9.09   7.88             92.44
Korea    4.04   3.78   3.45   4.20   4.62             40.18
Mexico   2.01   2.05   1.50   2.25   2.54             20.70

# 결측치처리

In [88]:
import numpy as np
pd.NA,np.nan

(<NA>, nan)

In [89]:
pd.isnull(np.nan),pd.isnull(pd.NA)

(True, True)

In [91]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'age': [25, np.nan, 30, 22, np.nan],
    'score': [90, 85, np.nan, 88, 95],
    'city': ['Seoul', 'Busan', np.nan, 'Incheon', 'Seoul']
}
data

{'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
 'age': [25, nan, 30, 22, nan],
 'score': [90, 85, nan, 88, 95],
 'city': ['Seoul', 'Busan', nan, 'Incheon', 'Seoul']}

In [106]:
df = pd.DataFrame(data)

# 결측치 채우기 및 포맷 정리
#
#df['score'] = df['score'].fillna(0).round(1)
#df['city'] = df['city'].fillna(0)

#df['age'].mean()
df

      name   age  score     city
0    Alice  25.0   90.0    Seoul
1      Bob   NaN   85.0    Busan
2  Charlie  30.0    NaN      NaN
3    David  22.0   88.0  Incheon
4      Eva   NaN   95.0    Seoul

In [109]:
df['score'] = df['score'].fillna(df['score'].median()).round(1)
df['age'] = df['age'].fillna(df['age'].mean()).round(1)
df['city'] = df['city'].fillna(0)
df

      name   age  score     city
0    Alice  25.0   90.0    Seoul
1      Bob  25.7   85.0    Busan
2  Charlie  30.0   89.0        0
3    David  22.0   88.0  Incheon
4      Eva  25.7   95.0    Seoul

# 타이타닉 연습이다이!

In [137]:
titanic_df=pd.read_csv('./data/titanic.csv')
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [138]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [143]:
titanic_df['Age'] =titanic_df['Age'].fillna(titanic_df['Age'].median(),inplace=True).round(1)

C:\Users\Admin\AppData\Local\Temp\ipykernel_14816\466776867.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_df['Age'] =titanic_df['Age'].fillna(titanic_df['Age'].median(),inplace=True).round(1)

AttributeError: 'NoneType' object has no attribute 'round'

In [142]:
titanic_df['Age'].mean()

nan

In [130]:
titanic_df['Age'].plot(kind='hist')

TypeError: no numeric data to plot

In [146]:
titanic_df['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [147]:
#'unknown'
titanic_df['Cabin'].fillna('unknown',inplace=True)

In [148]:
titanic_df['Cabin'].value_counts().head(5)

Cabin
unknown        687
G6               4
C23 C25 C27      4
B96 B98          4
F2               3
Name: count, dtype: int64

# Embarked 속성

In [151]:
titanic_df['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [154]:
titanic_df['Sex'].map({'male':0, 'female':1})

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int64

In [2]:
! pip install kagglehub[pandas-datasets]

Collecting kagglehub[pandas-datasets]
  Downloading kagglehub-0.4.2-py3-none-any.whl.metadata (38 kB)
Collecting kagglesdk<1.0,>=0.1.14 (from kagglehub[pandas-datasets])
  Downloading kagglesdk-0.1.15-py3-none-any.whl.metadata (13 kB)
Requirement already satisfied: packaging in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from kagglehub[pandas-datasets]) (25.0)
Requirement already satisfied: pyyaml in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from kagglehub[pandas-datasets]) (6.0.3)
Requirement already satisfied: requests in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from kagglehub[pandas-datasets]) (2.32.5)
Collecting tqdm (from kagglehub[pandas-datasets])
  Downloading tqdm-4.67.3-py3-none-any.whl.metadata (57 kB)
Requirement already satisfied: pandas in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from kagglehub[pandas-datasets]) (2.3.3)
Requirement already satisfied: protobuf in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from kagglesdk<1.0,>=0.1.14->kagglehub[pandas-datasets]) (6.33.3)
Requirement already satisfied: numpy>=1.22.4 in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from pandas->kagglehub[pandas-datasets]) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from pandas->kagglehub[pandas-datasets]) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from pandas->kagglehub[pandas-datasets]) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from pandas->kagglehub[pandas-datasets]) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from python-dateutil>=2.8.2->pandas->kagglehub[pandas-datasets]) (1.17.0)
Requirement already satisfied: charset_normalizer<4,>=2 in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from requests->kagglehub[pandas-datasets]) (3.4.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from requests->kagglehub[pandas-datasets]) (3.11)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from requests->kagglehub[pandas-datasets]) (2.6.3)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from requests->kagglehub[pandas-datasets]) (2026.1.4)
Requirement already satisfied: colorama in c:\users\admin\miniconda3\envs\stats\lib\site-packages (from tqdm->kagglehub[pandas-datasets]) (0.4.6)
Downloading kagglehub-0.4.2-py3-none-any.whl (69 kB)
Downloading kagglesdk-0.1.15-py3-none-any.whl (160 kB)
Downloading tqdm-4.67.3-py3-none-any.whl (78 kB)
Installing collected packages: tqdm, kagglesdk, kagglehub

   ------------- -------------------------- 1/3 [kagglesdk]
   -------------------------- ------------- 2/3 [kagglehub]
   ---------------------------------------- 3/3 [kagglehub]

Successfully installed kagglehub-0.4.2 kagglesdk-0.1.15 tqdm-4.67.3

In [4]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("dolbokostya/math-problems-with-answers-aime-imo")

print("Path to dataset files:", path)

Downloading to C:\Users\Admin\.cache\kagglehub\datasets\dolbokostya\math-problems-with-answers-aime-imo\1.archive...

100%|██████████| 125k/125k [00:00<00:00, 582kB/s]

Extracting files...
Path to dataset files: C:\Users\Admin\.cache\kagglehub\datasets\dolbokostya\math-problems-with-answers-aime-imo\versions\1

In [5]:
# Install dependencies as needed:
# pip install kagglehub[pandas-datasets]
import kagglehub
from kagglehub import KaggleDatasetAdapter

# Set the path to the file you'd like to load
file_path = ""

# Load the latest version
df = kagglehub.load_dataset(
  KaggleDatasetAdapter.PANDAS,
  "dolbokostya/math-problems-with-answers-aime-imo",
  file_path,
  # Provide any additional arguments like 
  # sql_query or pandas_kwargs. See the 
  # documenation for more information:
  # https://github.com/Kaggle/kagglehub/blob/main/README.md#kaggledatasetadapterpandas
)

print("First 5 records:", df.head())

C:\Users\Admin\AppData\Local\Temp\ipykernel_12960\2976249056.py:10: DeprecationWarning: Use dataset_load() instead of load_dataset(). load_dataset() will be removed in a future version.
  df = kagglehub.load_dataset(

ValueError: Unsupported file extension: ''. Supported file extensions are: .csv, .tsv, .json, .jsonl, .xml, .parquet, .feather, .sqlite, .sqlite3, .db, .db3, .s3db, .dl3, .xls, .xlsx, .xlsm, .xlsb, .odf, .ods, .odt